cfd/FILTER_H13/CASE_H/constant/kvo250_static_curve_Pa
// Source SI values, unchanged
(
(0 688)
(0.1042 640)
(0.2083 480)
(0.254 388)
(0.3333 205)
(0.417 0)
)
