cfd/FILTER_H13/CASE_H/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

libs            ( "$FOAM_CASE/dynamicCode/platforms/linux64GccDPInt32Opt/lib/libkvo250TerminalSuction_69288ba6138aa0e6b03100f329de6d70c031e030.so" );

solver          incompressibleFluid;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1;

writeControl    timeStep;

writeInterval   250;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

functions
{
    inletFlow
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        patch           AIR_INLET;
        operation       orientedSum;
        fields          ( phi );
        writeFields     false;
        writeControl    timeStep;
        writeInterval   10;
        log             true;
    }
    outletFlow
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        patch           AIR_OUTLET;
        operation       orientedSum;
        fields          ( phi );
        writeFields     false;
        writeControl    timeStep;
        writeInterval   10;
        log             true;
    }
    inletPressure
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        patch           AIR_INLET;
        operation       areaAverage;
        fields          ( p );
        writeFields     false;
        writeControl    timeStep;
        writeInterval   10;
        log             true;
    }
    inletVelocity
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        patch           AIR_INLET;
        operation       areaAverage;
        fields          ( U );
        writeFields     false;
        writeControl    timeStep;
        writeInterval   10;
        log             true;
    }
    yPlus
    {
        type            yPlus;
        libs            ( "libfieldFunctionObjects.so" );
        executeControl  writeTime;
        writeControl    writeTime;
    }
    filterFlow
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        patch           FILTER_UPSTREAM;
        operation       orientedSum;
        fields          ( phi );
        writeFields     false;
        writeControl    timeStep;
        writeInterval   10;
        log             true;
    }
    filterPressureUp
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        patch           FILTER_UPSTREAM;
        operation       areaAverage;
        fields          ( p );
        writeFields     false;
        writeControl    timeStep;
        writeInterval   10;
        log             true;
    }
    filterPressureDown
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        patch           FILTER_DOWNSTREAM;
        operation       areaAverage;
        fields          ( p );
        writeFields     false;
        writeControl    timeStep;
        writeInterval   10;
        log             true;
    }
}


// ************************************************************************* //
